Extensions/АБ/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Организации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_КрупнейшийНалогоплательщик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КодНалоговогоОрганаПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КрупнейшийНалогоплательщикКПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КрупнейшийНалогоплательщикНаименованиеНалоговогоОргана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УВМ_РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/АБ/InformationRegisters/УВМ_ИсторияРегистрацийВНалоговомОргане.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УВМ_ИсторияРегистрацийВНалоговомОргане</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УВМ_РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/АБ/Catalogs/Организации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура АБ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ГруппаКрупнейшийНалогоплательщик = УВМ_РаботаСФормами.НоваяГруппаОбычная(ЭтаФорма, "ГруппаКрупнейшийНалогоплательщик", Элементы.ГруппаКолонкаСлева, "Крупнейший налогоплательщик");
	
	УВМ_КрупнейшийНалогоплательщик = УВМ_РаботаСФормами.НовоеПолеФлажок(ЭтаФорма, "УВМ_КрупнейшийНалогоплательщик", 
		ГруппаКрупнейшийНалогоплательщик, "Объект.УВМ_КрупнейшийНалогоплательщик");
	УВМ_КрупнейшийНалогоплательщик.УстановитьДействие("ПриИзменении", "КрупнейшийНалогоплательщикПриИзменении");	
	
	ГруппаРеквизитыКрупнейшегоНалогоплательщика = УВМ_РаботаСФормами.НоваяГруппаОбычная(ЭтаФорма, "ГруппаРеквизитыКрупнейшегоНалогоплательщика", ГруппаКрупнейшийНалогоплательщик); 
	ГруппаРеквизитыКрупнейшегоНалогоплательщика.ОтображатьЗаголовок = Ложь;
	
	ГиперссылкаОткрытьРегистрацию = УВМ_РаботаСФормами.НоваяКомандаНаФорме(ЭтаФорма, "ОткрытьРегистрациюВНалоговыхОрганах", ГруппаРеквизитыКрупнейшегоНалогоплательщика, "Изменить", ,2);
	ГиперссылкаОткрытьРегистрацию.Кнопка.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСверху;
	ГиперссылкаОткрытьРегистрацию.Команда.Подсказка = ПолучитьЗаголовокКрупнейшейОрганизации();  
	ГиперссылкаОткрытьРегистрацию.Кнопка.РасширеннаяПодсказка.Ширина = 70;
	
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_КодНалоговогоОрганаПолучателя", ГруппаРеквизитыКрупнейшегоНалогоплательщика, "Объект.УВМ_КодНалоговогоОрганаПолучателя");
	
	ГруппаКППКрупнейшийНалогоплательщик = УВМ_РаботаСФормами.НоваяГруппаОбычная(ЭтаФорма, "ГруппаКППКрупнейшийНалогоплательщик", ГруппаРеквизитыКрупнейшегоНалогоплательщика);
	ГруппаКППКрупнейшийНалогоплательщик.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаКППКрупнейшийНалогоплательщик.ОтображатьЗаголовок = Ложь;
	ГруппаКППКрупнейшийНалогоплательщик.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_КрупнейшийНалогоплательщикКПП", ГруппаКППКрупнейшийНалогоплательщик, "Объект.УВМ_КрупнейшийНалогоплательщикКПП");
	УВМ_РаботаСФормами.НоваяКомандаНаФорме(ЭтаФорма, "ИсторияКППКрупнейшийНалогоплательщик", ГруппаКППКрупнейшийНалогоплательщик, ПолучитьЗаголовокИстории(), ,2);
	
	
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_КрупнейшийНалогоплательщикНаименованиеНалоговогоОргана", ГруппаРеквизитыКрупнейшегоНалогоплательщика, "Объект.УВМ_КрупнейшийНалогоплательщикНаименованиеНалоговогоОргана");
	УВМ_РаботаСФормами.НовоеПоле(ЭтаФорма, "УВМ_КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане", ГруппаРеквизитыКрупнейшегоНалогоплательщика, "Объект.УВМ_КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане");
	
	ГруппаРеквизитыКрупнейшегоНалогоплательщика.Видимость = Объект.УВМ_КрупнейшийНалогоплательщик;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаголовокКрупнейшейОрганизации()
	Возврат стрШаблон("Организация состоит на учете в налоговом органе: ФНС %1 КПП %2", 
		?(ЗначениеЗаполнено(Объект.УВМ_КодНалоговогоОрганаПолучателя), Объект.УВМ_КодНалоговогоОрганаПолучателя, "<..>"), 
		?(ЗначениеЗаполнено(Объект.УВМ_КрупнейшийНалогоплательщикКПП), Объект.УВМ_КрупнейшийНалогоплательщикКПП, "<..>"));
КонецФункции	

&НаСервере
Функция ПолучитьЗаголовокИстории() 
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначенияРегистра = РегистрыСведений.УВМ_ИсторияРегистрацийВНалоговомОргане.СрезПоследних( , Новый Структура("Организация", Объект.Ссылка));
		Если ЗначенияРегистра.Количество() > 0 Тогда
			Возврат стрШаблон("Действует с: %1", Формат(ЗначенияРегистра[0].Период,"ДФ=dd.MM.yyyy"));
		Иначе
			Возврат "История";
		КонецЕсли;	
	Иначе
		Возврат "История";
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура КрупнейшийНалогоплательщикПриИзменении(Команда)
	Элементы.Найти("ГруппаРеквизитыКрупнейшегоНалогоплательщика").Видимость = Объект.УВМ_КрупнейшийНалогоплательщик;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистрациюВНалоговыхОрганах(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) И Не Модифицированность 
		И Объект.УВМ_КрупнейшийНалогоплательщик = Истина 
		И ЗначениеЗаполнено(Объект.УВМ_КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане)
	Тогда
		Форма = ПолучитьФорму("Справочник.УВМ_РегистрацииВНалоговомОргане.ФормаОбъекта", Новый Структура("Ключ", Объект.УВМ_КрупнейшийНалогоплательщикРегистрацияВНалоговомОргане));
		Форма.ТолькоПросмотр = Истина;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсторияКППКрупнейшийНалогоплательщик(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) И Не Модифицированность 
		И Объект.УВМ_КрупнейшийНалогоплательщик = Истина 
	Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Объект.Ссылка);
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Организация", Объект.Ссылка);
		СтруктураПараметров.Вставить("Отбор", СтруктураОтбора); 
		ОткрытьФорму("РегистрСведений.УВМ_ИсторияРегистрацийВНалоговомОргане.Форма.ФормаСписка", СтруктураПараметров, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры
